In [142]:
import pandas as pd
import numpy as np

In [191]:
df1 = pd.read_csv('employees.csv')

# Load the second dataset (only when you reach the Merging/Joining questions)
df2 = pd.read_csv('departments.csv')
df2

   Dept_Name       Manager  Floor
0         HR  Sarah Connor      1
1         IT     John Wick      2
2      Sales    Tony Stark      3
3  Marketing   Bruce Wayne      4
4    Finance  Gordon Gekko      5

In [194]:
df2
df2.rename(columns={'Dept_Name':'Department'},inplace = True)
df2

  Department       Manager  Floor
0         HR  Sarah Connor      1
1         IT     John Wick      2
2      Sales    Tony Stark      3
3  Marketing   Bruce Wayne      4
4    Finance  Gordon Gekko      5

1.  **Creation:** Create a pandas Series from a Python list `[10, 20, 30]` with custom indices `['a', 'b', 'c']`.

In [88]:
l = [10, 20, 30]
n=['a','b','c']
S = pd.Series(l,index=n)
S.reset_index()

  index   0
0     a  10
1     b  20
2     c  30

2.  **Numpy conversion:** Given a Series `s`, write code to extract its underlying data as a NumPy array (Hint: `.values`).

In [11]:
S.values

array([10, 20, 30], dtype=int64)

3.  **Index extraction:** Write code to print *only* the index labels of a Series `s`.

In [9]:
S.index

Index(['a', 'b', 'c'], dtype='object')

4.  **Naming:** Create a Series and assign it the name "Student_Marks". Print the name to verify.

In [13]:
s = pd.Series([23,45,24,21,56,24,67],name = 'Student_marks')
s.name

'Student_marks'

5.  **Uniqueness:** Given `s = pd.Series([1, 2, 3, 3])`, write code to check if all values in `s` are unique (returns a single Boolean).

In [22]:
s = pd.Series([1, 2, 3, 3])
s.is_unique

False

6.  **Size vs Shape:** Print the `.size` and `.shape` of a Series. Are they different?

In [23]:
print(s.size)
print(s.shape)

4
(4,)

7.  **Preview:** Write code to show the first 3 and last 3 rows of a massive Series.

In [27]:
df1.head(3)

,ID,Name,Age,Department,Salary,Join_Date,City,Email
0,101,Alice Smith,25.0,HR,50000.0,2020-01-15,New York,alice@gmail.com
1,102,Bob Jones,30.0,IT,60000.0,2019-05-20,Los Angeles,bob@yahoo.com
2,103,Charlie Brown,35.0,Sales,55000.0,2021-03-10,New York,charlie@gmail.com

In [28]:
df1.tail(3)

,ID,Name,Age,Department,Salary,Join_Date,City,Email
12,113,Mona Lisa,27.0,Sales,54000.0,2021-12-01,Bhopal,mona@gmail.com
13,114,NaN,33.0,Marketing,66000.0,2018-03-15,Los Angeles,NaN
14,115,Oliver Twist,38.0,Admin,78000.0,2017-10-30,Chicago,oliver@company.com

8.  **Type Check:** Write code to check the data type (`dtype`) of the elements in a Series.

In [29]:
s.dtype

dtype('int64')

9.  **Memory Usage:** Write a command to display the memory usage of a Series including its index.

In [40]:
df1.memory_usage(index=True, deep = True)

Index         132
ID            120
Name          862
Age           120
Department    794
Salary        120
Join_Date     885
City          854
Email         931
dtype: int64

13. **Frequency Count:** Given `s = pd.Series(['a', 'b', 'a', 'c', 'a', 'b'])`, count how many times each letter appears.

In [41]:
s = pd.Series(['a', 'b', 'a', 'c', 'a', 'b'])
s.value_counts()

a    3
b    2
c    1
Name: count, dtype: int64

14. **Relative Frequency:** Modify the previous code to show **percentages** instead of raw counts (Hint: `normalize`).

In [44]:
s = pd.Series(['a', 'b', 'a', 'c', 'a', 'b'])
s.value_counts(normalize=True) * 100

a    50.000000
b    33.333333
c    16.666667
Name: proportion, dtype: float64

15. **Unique Items:** Extract an array of the distinct values in `s`.

In [45]:
s = pd.Series(['a', 'b', 'a', 'c', 'a', 'b','c','e','b','s','a'])
s.unique()

array(['a', 'b', 'c', 'e', 's'], dtype=object)

16. **Count Distinct:** Write code to return the *number* of unique values in `s` (Answer should be an integer).

In [46]:
s.nunique()

5

17. **Sorting Values:** Sort `s` in **descending** order.

In [49]:
S.sort_values(ascending=False)

c    30
b    20
a    10
dtype: int64

18. **Na Position:** You have `s = pd.Series([10, np.nan, 20])`. Sort it such that the `NaN` appears at the **top** (beginning).

In [9]:
s = pd.Series([10, np.nan, 20])
s.sort_values(na_position='first')

1     NaN
0    10.0
2    20.0
dtype: float64

19. **Filtering (Isin):** Given `s = pd.Series(['cat', 'dog', 'bird', 'fish'])`, select only the elements that are either 'cat' or 'fish' using `.isin()`.

In [13]:
s = pd.Series(['cat', 'dog', 'bird', 'fish'])
b = s[s.isin(['cat','fish'])]
b

0     cat
3    fish
dtype: object

20. **Boolean Indexing:** Select all values in a numeric Series `s` that are greater than the mean of `s`.

In [18]:
s = pd.Series([3,5,7,4,6,8,3,7,5,6,8,6])
print(s.mean())
b = s[s > s.mean()]
b

5.666666666666667

2     7
4     6
5     8
7     7
9     6
10    8
11    6
dtype: int64

23. **Dict to DF:** Create a DataFrame from this dictionary: `{'Name': ['Tom', 'Jerry'], 'Age': [20, 22]}`.

In [19]:
a = pd.DataFrame({'Name': ['Tom', 'Jerry'], 'Age': [20, 22]})
a

    Name  Age
0    Tom   20
1  Jerry   22

24. **Column Selection:** Write code to select just the 'Name' column as a **Series**.

In [26]:
# s = df1['Name']
# s
df1.Name

0       Alice Smith
1         Bob Jones
2     Charlie Brown
3      David Wilson
4         Eva Green
5       Frank White
6         Grace Lee
7      Hannah Black
8          Ian Grey
9          Jane Doe
10      Alice Smith
11       Liam Scott
12        Mona Lisa
13              NaN
14     Oliver Twist
Name: Name, dtype: object

25. **Column Selection (Frame):** Write code to select just the 'Name' column as a **DataFrame** (Keep the dimension).

In [30]:
# a = pd.DataFrame(df1["Name"])
# a

df1[['Name']]

             Name
0     Alice Smith
1       Bob Jones
2   Charlie Brown
3    David Wilson
4       Eva Green
5     Frank White
6       Grace Lee
7    Hannah Black
8        Ian Grey
9        Jane Doe
10    Alice Smith
11     Liam Scott
12      Mona Lisa
13            NaN
14   Oliver Twist

26. **CSV Reading:** Read a file `data.csv` but only load the columns "Age" and "Salary". (Hint: `usecols`).

In [33]:
d = pd.read_csv('employees.csv', usecols = ['Age','Salary'])
d

     Age   Salary
0   25.0  50000.0
1   30.0  60000.0
2   35.0  55000.0
3   40.0  70000.0
4   22.0  48000.0
5   28.0  52000.0
6   34.0  65000.0
7    NaN      NaN
8   45.0  80000.0
9   29.0  51000.0
10  25.0  50000.0
11  31.0  62000.0
12  27.0  54000.0
13  33.0  66000.0
14  38.0  78000.0

27. **Headerless CSV:** Read a CSV file that has no headers, and assign your own column names `['A', 'B', 'C']`.

28. **Structure:** Write the command to print the summary of a DataFrame (columns, non-null counts, dtypes).

In [35]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          15 non-null     int64
 1   Name        14 non-null     object
 2   Age         14 non-null     float64
 3   Department  15 non-null     object
 4   Salary      14 non-null     float64
 5   Join_Date   15 non-null     object
 6   City        15 non-null     object
 7   Email       14 non-null     object
dtypes: float64(2), int64(1), object(5)
memory usage: 1.1+ KB

29. **Statistics:** Generate descriptive statistics (mean, min, max, quartiles) for all numeric columns.

In [38]:
df1.describe()

               ID        Age        Salary
count   15.000000  14.000000     14.000000
mean   108.000000  31.571429  60071.428571
std      4.472136   6.405698  10520.780066
min    101.000000  22.000000  48000.000000
25%    104.500000  27.250000  51250.000000
50%    108.000000  30.500000  57500.000000
75%    111.500000  34.750000  65750.000000
max    115.000000  45.000000  80000.000000

30. **Numpy to DF:** Create a DataFrame with 5 rows and 3 columns filled with random numbers.

In [52]:
pd.DataFrame(np.random.randint(100,200,15).reshape(5,3))

     0    1    2
0  113  193  166
1  159  168  100
2  176  121  138
3  132  165  124
4  132  194  151

33. **Set Index:** Make the 'ID' column the index of the DataFrame `df`.

In [57]:
df1.set_index('ID')

,Name,Age,Department,Salary,Join_Date,City,Email
ID,,,,,,,
101,Alice Smith,25.0,HR,50000.0,2020-01-15,New York,alice@gmail.com
102,Bob Jones,30.0,IT,60000.0,2019-05-20,Los Angeles,bob@yahoo.com
103,Charlie Brown,35.0,Sales,55000.0,2021-03-10,New York,charlie@gmail.com
104,David Wilson,40.0,IT,70000.0,2018-07-25,Chicago,david@outlook.com
105,Eva Green,22.0,HR,48000.0,2022-01-05,Chicago,eva@gmail.com
106,Frank White,28.0,Sales,52000.0,2020-09-12,New York,frank@yahoo.com
107,Grace Lee,34.0,Marketing,65000.0,2019-11-01,Los Angeles,grace@gmail.com
108,Hannah Black,NaN,IT,NaN,2021-06-15,Bhopal,hannah@gmail.com
109,Ian Grey,45.0,Admin,80000.0,2017-02-28,Bhopal,ian@company.com
110,Jane Doe,29.0,HR,51000.0,2020-04-10,New York,jane@outlook.com
111,Alice Smith,25.0,HR,50000.0,2020-01-15,New York,alice@gmail.com
112,Liam Scott,31.0,IT,62000.0,2019-08-08,Chicago,liam@yahoo.com
113,Mona Lisa,27.0,Sales,54000.0,2021-12-01,Bhopal,mona@gmail.com
114,NaN,33.0,Marketing,66000.0,2018-03-15,Los Angeles,NaN
115,Oliver Twist,38.0,Admin,78000.0,2017-10-30,Chicago,oliver@company.com

34. **Loc (Label):** Select the row with index label "Row_5".

In [71]:
df1.loc[4]

ID                      105
Name              Eva Green
Age                    22.0
Department               HR
Salary              48000.0
Join_Date        2022-01-05
City                Chicago
Email         eva@gmail.com
Name: 4, dtype: object

35. **Loc (Slicing):** Select rows from index label "A" to "C" (inclusive) and columns "Name" and "Age".

In [75]:
df1.loc[0:2,'Name':'Age']

            Name   Age
0    Alice Smith  25.0
1      Bob Jones  30.0
2  Charlie Brown  35.0

36. **Iloc (Position):** Select the first 5 rows and the last 2 columns using integer positions.

In [79]:
df1.iloc[0:6,-1:-3:-1]

               Email         City
0    alice@gmail.com     New York
1      bob@yahoo.com  Los Angeles
2  charlie@gmail.com     New York
3  david@outlook.com      Chicago
4      eva@gmail.com      Chicago
5    frank@yahoo.com     New York

37. **Conditional Loc:** Update the "Status" column to "Passed" for all rows where "Grade" > 70.

In [83]:
df1.loc[df1['Department'] == 'Sales' ,'City' ] = 'Ujjain'
df1

,ID,Name,Age,Department,Salary,Join_Date,City,Email
0,101,Alice Smith,25.0,HR,50000.0,2020-01-15,New York,alice@gmail.com
1,102,Bob Jones,30.0,IT,60000.0,2019-05-20,Los Angeles,bob@yahoo.com
2,103,Charlie Brown,35.0,Sales,55000.0,2021-03-10,Ujjain,charlie@gmail.com
3,104,David Wilson,40.0,IT,70000.0,2018-07-25,Chicago,david@outlook.com
4,105,Eva Green,22.0,HR,48000.0,2022-01-05,Chicago,eva@gmail.com
5,106,Frank White,28.0,Sales,52000.0,2020-09-12,Ujjain,frank@yahoo.com
6,107,Grace Lee,34.0,Marketing,65000.0,2019-11-01,Los Angeles,grace@gmail.com
7,108,Hannah Black,NaN,IT,NaN,2021-06-15,Bhopal,hannah@gmail.com
8,109,Ian Grey,45.0,Admin,80000.0,2017-02-28,Bhopal,ian@company.com
9,110,Jane Doe,29.0,HR,51000.0,2020-04-10,New York,jane@outlook.com
10,111,Alice Smith,25.0,HR,50000.0,2020-01-15,New York,alice@gmail.com
11,112,Liam Scott,31.0,IT,62000.0,2019-08-08,Chicago,liam@yahoo.com
12,113,Mona Lisa,27.0,Sales,54000.0,2021-12-01,Ujjain,mona@gmail.com
13,114,NaN,33.0,Marketing,66000.0,2018-03-15,Los Angeles,NaN
14,115,Oliver Twist,38.0,Admin,78000.0,2017-10-30,Chicago,oliver@company.com

38. **Fancy Indexing:** Select rows 1, 3, and 5 using a list of integers.

In [91]:
df1.iloc[1:6:2]

,ID,Name,Age,Department,Salary,Join_Date,City,Email
1,102,Bob Jones,30.0,IT,60000.0,2019-05-20,Los Angeles,bob@yahoo.com
3,104,David Wilson,40.0,IT,70000.0,2018-07-25,Chicago,david@outlook.com
5,106,Frank White,28.0,Sales,52000.0,2020-09-12,Ujjain,frank@yahoo.com

39. **Reset Index:** Your index is messy. Reset it to the default 0, 1, 2... and drop the old index completely.

In [ ]:
done in first question go and check

40. **Fast Scalar Access:** (Bonus) Look up the value at row label 'X' and column 'Y' using `.at` (faster than loc).

43. **Find Nulls:** Return a Boolean DataFrame showing True where data is missing.

In [93]:
import pandas as pd
import numpy as np

data = {
    'Transaction_ID': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
    'Date': ['2023-01-01', '2023-01-02', '2023-01-02', '2023-01-04', np.nan, '2023-01-06', '2023-01-07', '2023-01-08', '2023-01-09', '2023-01-10', '2023-01-11', '2023-01-12', '2023-01-13', '2023-01-14', '2023-01-15'],
    'Customer_Name': ['John Doe', 'Jane Smith', 'Jane Smith', 'Mike Brown', 'Sarah Lee', np.nan, 'Chris Post', 'Anna Bell', 'Tom Hardy', 'John Doe', 'None', 'Jane Smith', '  ', 'Bill Gates', 'Steve Jobs'],
    'Age': [28, 34, 34, 150, 22, 45, np.nan, 31, 29, 28, 40, 34, 50, 65, 56],
    'Purchase_Amount': [100.50, 250.00, 250.00, 50.25, None, 120.00, 300.00, -10.00, np.nan, 100.50, 500.00, 250.00, 0.00, 9999.99, 150.00],
    'Category': ['Electronics', 'Home', 'Home', 'Electronics', 'Grocery', 'Grocery', 'Electronics', 'Home', 'None', 'Electronics', 'Electronics', 'Home', 'Grocery', 'Tech', 'Tech'],
    'Is_Member': [True, True, True, False, np.nan, True, False, True, True, True, False, True, False, True, False]
}

df3 = pd.DataFrame(data)

In [100]:
df3.isnull()

,Transaction_ID,Date,Customer_Name,Age,Purchase_Amount,Category,Is_Member
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False
4,False,True,False,False,True,False,True
5,False,False,True,False,False,False,False
6,False,False,False,True,False,False,False
7,False,False,False,False,False,False,False
8,False,False,False,False,True,False,False
9,False,False,False,False,False,False,False
10,False,False,False,False,False,False,False
11,False,False,False,False,False,False,False
12,False,False,False,False,False,False,False
13,False,False,False,False,False,False,False
14,False,False,False,False,False,False,False

44. **Count Nulls:** Calculate the total number of missing values in *each column*.

In [101]:
df3.isna().sum()

Transaction_ID     0
Date               1
Customer_Name      1
Age                1
Purchase_Amount    2
Category           0
Is_Member          1
dtype: int64

45. **Filter Nulls:** Display only the rows that contain at least one missing value.

In [103]:
df3[df3.isnull().any(axis=1)]

,Transaction_ID,Date,Customer_Name,Age,Purchase_Amount,Category,Is_Member
4,5,NaN,Sarah Lee,22.0,NaN,Grocery,NaN
5,6,2023-01-06,NaN,45.0,120.0,Grocery,True
6,7,2023-01-07,Chris Post,NaN,300.0,Electronics,False
8,9,2023-01-09,Tom Hardy,29.0,NaN,None,True

46. **Drop Rows:** Remove all rows that contain *any* missing values.

In [104]:
df3.dropna()

,Transaction_ID,Date,Customer_Name,Age,Purchase_Amount,Category,Is_Member
0,1,2023-01-01,John Doe,28.0,100.50,Electronics,True
1,2,2023-01-02,Jane Smith,34.0,250.00,Home,True
2,3,2023-01-02,Jane Smith,34.0,250.00,Home,True
3,4,2023-01-04,Mike Brown,150.0,50.25,Electronics,False
7,8,2023-01-08,Anna Bell,31.0,-10.00,Home,True
9,10,2023-01-10,John Doe,28.0,100.50,Electronics,True
10,11,2023-01-11,None,40.0,500.00,Electronics,False
11,12,2023-01-12,Jane Smith,34.0,250.00,Home,True
12,13,2023-01-13,,50.0,0.00,Grocery,False
13,14,2023-01-14,Bill Gates,65.0,9999.99,Tech,True
14,15,2023-01-15,Steve Jobs,56.0,150.00,Tech,False

47. **Drop Columns:** Remove columns that contain *any* missing values.

In [107]:
df3.dropna(axis=1)

    Transaction_ID     Category
0                1  Electronics
1                2         Home
2                3         Home
3                4  Electronics
4                5      Grocery
5                6      Grocery
6                7  Electronics
7                8         Home
8                9         None
9               10  Electronics
10              11  Electronics
11              12         Home
12              13      Grocery
13              14         Tech
14              15         Tech

48. **Threshold Drop:** Drop rows only if they have **more than 2** missing values.

49. **Fill (Constant):** Replace all NaNs with the number 0.

In [109]:
df3.fillna(0)

,Transaction_ID,Date,Customer_Name,Age,Purchase_Amount,Category,Is_Member
0,1,2023-01-01,John Doe,28.0,100.50,Electronics,True
1,2,2023-01-02,Jane Smith,34.0,250.00,Home,True
2,3,2023-01-02,Jane Smith,34.0,250.00,Home,True
3,4,2023-01-04,Mike Brown,150.0,50.25,Electronics,False
4,5,0,Sarah Lee,22.0,0.00,Grocery,0
5,6,2023-01-06,0,45.0,120.00,Grocery,True
6,7,2023-01-07,Chris Post,0.0,300.00,Electronics,False
7,8,2023-01-08,Anna Bell,31.0,-10.00,Home,True
8,9,2023-01-09,Tom Hardy,29.0,0.00,None,True
9,10,2023-01-10,John Doe,28.0,100.50,Electronics,True
10,11,2023-01-11,None,40.0,500.00,Electronics,False
11,12,2023-01-12,Jane Smith,34.0,250.00,Home,True
12,13,2023-01-13,,50.0,0.00,Grocery,False
13,14,2023-01-14,Bill Gates,65.0,9999.99,Tech,True
14,15,2023-01-15,Steve Jobs,56.0,150.00,Tech,False

50. **Fill (Mean):** Fill missing values in the "Age" column with the mean age.

In [111]:
df3.fillna(df3['Age'].mean())

,Transaction_ID,Date,Customer_Name,Age,Purchase_Amount,Category,Is_Member
0,1,2023-01-01,John Doe,28.000000,100.500000,Electronics,True
1,2,2023-01-02,Jane Smith,34.000000,250.000000,Home,True
2,3,2023-01-02,Jane Smith,34.000000,250.000000,Home,True
3,4,2023-01-04,Mike Brown,150.000000,50.250000,Electronics,False
4,5,46.142857,Sarah Lee,22.000000,46.142857,Grocery,46.142857
5,6,2023-01-06,46.142857,45.000000,120.000000,Grocery,True
6,7,2023-01-07,Chris Post,46.142857,300.000000,Electronics,False
7,8,2023-01-08,Anna Bell,31.000000,-10.000000,Home,True
8,9,2023-01-09,Tom Hardy,29.000000,46.142857,None,True
9,10,2023-01-10,John Doe,28.000000,100.500000,Electronics,True
10,11,2023-01-11,None,40.000000,500.000000,Electronics,False
11,12,2023-01-12,Jane Smith,34.000000,250.000000,Home,True
12,13,2023-01-13,,50.000000,0.000000,Grocery,False
13,14,2023-01-14,Bill Gates,65.000000,9999.990000,Tech,True
14,15,2023-01-15,Steve Jobs,56.000000,150.000000,Tech,False

51. **Forward Fill:** Fill missing values using the value from the previous row (`ffill`).

In [114]:
df3.ffill()

C:\Users\HP\AppData\Local\Temp\ipykernel_20236\2012176106.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df3.ffill()

,Transaction_ID,Date,Customer_Name,Age,Purchase_Amount,Category,Is_Member
0,1,2023-01-01,John Doe,28.0,100.50,Electronics,True
1,2,2023-01-02,Jane Smith,34.0,250.00,Home,True
2,3,2023-01-02,Jane Smith,34.0,250.00,Home,True
3,4,2023-01-04,Mike Brown,150.0,50.25,Electronics,False
4,5,2023-01-04,Sarah Lee,22.0,50.25,Grocery,False
5,6,2023-01-06,Sarah Lee,45.0,120.00,Grocery,True
6,7,2023-01-07,Chris Post,45.0,300.00,Electronics,False
7,8,2023-01-08,Anna Bell,31.0,-10.00,Home,True
8,9,2023-01-09,Tom Hardy,29.0,-10.00,None,True
9,10,2023-01-10,John Doe,28.0,100.50,Electronics,True
10,11,2023-01-11,None,40.0,500.00,Electronics,False
11,12,2023-01-12,Jane Smith,34.0,250.00,Home,True
12,13,2023-01-13,,50.0,0.00,Grocery,False
13,14,2023-01-14,Bill Gates,65.0,9999.99,Tech,True
14,15,2023-01-15,Steve Jobs,56.0,150.00,Tech,False

54. **Basic Group:** Group `df` by "Department" and calculate the mean "Salary".

In [127]:
ct = df1.groupby('Department')[['Salary']].mean()
ct

                  Salary
Department
Admin       79000.000000
HR          49750.000000
IT          64000.000000
Marketing   65500.000000
Sales       53666.666667

In [126]:
stats = df1.groupby('Department')['Salary'].agg(['mean', 'median', 'count'])
stats

                    mean   median  count
Department
Admin       79000.000000  79000.0      2
HR          49750.000000  50000.0      4
IT          64000.000000  62000.0      3
Marketing   65500.000000  65500.0      2
Sales       53666.666667  54000.0      3

55. **Multiple Columns:** Group by both "Department" and "Gender" and find the max "Age".

In [132]:
ct = df1.groupby(['Department','City'])['Age'].max()
ct

Department  City
Admin       Bhopal         45.0
            Chicago        38.0
HR          Chicago        22.0
            New York       29.0
IT          Bhopal          NaN
            Chicago        40.0
            Los Angeles    30.0
Marketing   Los Angeles    34.0
Sales       Ujjain         35.0
Name: Age, dtype: float64

56. **Get Group:** Extract the sub-DataFrame for the "HR" department from a groupby object.

In [139]:
# ct = df1.groupby('Department')
# ct.get_group('HR')

ct = df1.groupby('Department').get_group('HR')
ct

,ID,Name,Age,Department,Salary,Join_Date,City,Email
0,101,Alice Smith,25.0,HR,50000.0,2020-01-15,New York,alice@gmail.com
4,105,Eva Green,22.0,HR,48000.0,2022-01-05,Chicago,eva@gmail.com
9,110,Jane Doe,29.0,HR,51000.0,2020-04-10,New York,jane@outlook.com
10,111,Alice Smith,25.0,HR,50000.0,2020-01-15,New York,alice@gmail.com

57. **Agg (Multiple):** Calculate both the `mean` and `sum` of "Sales" for each region using `.agg()`.

In [157]:
ct = df1.groupby(['Department','City'])
ct.get_group(('HR','Chicago'))

,ID,Name,Age,Department,Salary,Join_Date,City,Email
4,105,Eva Green,22.0,HR,48000.0,2022-01-05,Chicago,eva@gmail.com

58. **Agg (Custom):** Group by "City" and find the `mean` of "Temp" and the `max` of "Humidity" (Different functions for different columns).

In [161]:
ct = df1.groupby('City').agg({'Salary':'mean','Age':'max'})
ct

                   Salary   Age
City
Bhopal       67000.000000  45.0
Chicago      64500.000000  40.0
Los Angeles  63666.666667  34.0
New York     51600.000000  35.0

59. **Apply:** Write a custom function `range_diff` (max - min) and apply it to each group in "Salary".

In [166]:
def range_diff(x):
    return x.max() - x.min()

In [170]:
ct = df1.groupby('Department')['Salary'].apply(range_diff)
ct

Department
Admin         2000.0
HR            3000.0
IT           10000.0
Marketing     1000.0
Sales         3000.0
Name: Salary, dtype: float64

60. **Size vs Count:** Group by "Team" and run `.size()` and `.count()`. Explain the difference in the output.

63. **Concatenation (Vertical):** Stack two DataFrames `df1` and `df2` on top of each other.

In [177]:
a = pd.DataFrame([5,5,3,4,5,8,9,4])
b = pd.DataFrame([15,15,13,14,15,18,19,14])

pd.concat((a,b))

    0
0   5
1   5
2   3
3   4
4   5
5   8
6   9
7   4
0  15
1  15
2  13
3  14
4  15
5  18
6  19
7  14

64. **Concatenation (Horizontal):** Paste `df1` and `df2` side-by-side.

In [181]:
pd.concat((a,b),axis=1)

   0   0
0  5  15
1  5  15
2  3  13
3  4  14
4  5  15
5  8  18
6  9  19
7  4  14

65. **Inner Merge:** Merge `df_orders` and `df_customers` on "CustomerID" (keep only matching records).

In [199]:
pd.merge(df1,df2,how='inner', on = 'Department',indicator=True)

,ID,Name,Age,Department,Salary,Join_Date,City,Email,Manager,Floor,_merge
0,101,Alice Smith,25.0,HR,50000.0,2020-01-15,New York,alice@gmail.com,Sarah Connor,1,both
1,102,Bob Jones,30.0,IT,60000.0,2019-05-20,Los Angeles,bob@yahoo.com,John Wick,2,both
2,103,Charlie Brown,35.0,Sales,55000.0,2021-03-10,New York,charlie@gmail.com,Tony Stark,3,both
3,104,David Wilson,40.0,IT,70000.0,2018-07-25,Chicago,david@outlook.com,John Wick,2,both
4,105,Eva Green,22.0,HR,48000.0,2022-01-05,Chicago,eva@gmail.com,Sarah Connor,1,both
5,106,Frank White,28.0,Sales,52000.0,2020-09-12,New York,frank@yahoo.com,Tony Stark,3,both
6,107,Grace Lee,34.0,Marketing,65000.0,2019-11-01,Los Angeles,grace@gmail.com,Bruce Wayne,4,both
7,108,Hannah Black,NaN,IT,NaN,2021-06-15,Bhopal,hannah@gmail.com,John Wick,2,both
8,110,Jane Doe,29.0,HR,51000.0,2020-04-10,New York,jane@outlook.com,Sarah Connor,1,both
9,111,Alice Smith,25.0,HR,50000.0,2020-01-15,New York,alice@gmail.com,Sarah Connor,1,both
10,112,Liam Scott,31.0,IT,62000.0,2019-08-08,Chicago,liam@yahoo.com,John Wick,2,both
11,113,Mona Lisa,27.0,Sales,54000.0,2021-12-01,Bhopal,mona@gmail.com,Tony Stark,3,both
12,114,NaN,33.0,Marketing,66000.0,2018-03-15,Los Angeles,NaN,Bruce Wayne,4,both

66. **Left Join:** Keep all `df_employees` and add department info from `df_dept`. Fill missing matches with NaN.

In [201]:
pd.merge(df1,df2,how='left',indicator=True)

,ID,Name,Age,Department,Salary,Join_Date,City,Email,Manager,Floor,_merge
0,101,Alice Smith,25.0,HR,50000.0,2020-01-15,New York,alice@gmail.com,Sarah Connor,1.0,both
1,102,Bob Jones,30.0,IT,60000.0,2019-05-20,Los Angeles,bob@yahoo.com,John Wick,2.0,both
2,103,Charlie Brown,35.0,Sales,55000.0,2021-03-10,New York,charlie@gmail.com,Tony Stark,3.0,both
3,104,David Wilson,40.0,IT,70000.0,2018-07-25,Chicago,david@outlook.com,John Wick,2.0,both
4,105,Eva Green,22.0,HR,48000.0,2022-01-05,Chicago,eva@gmail.com,Sarah Connor,1.0,both
5,106,Frank White,28.0,Sales,52000.0,2020-09-12,New York,frank@yahoo.com,Tony Stark,3.0,both
6,107,Grace Lee,34.0,Marketing,65000.0,2019-11-01,Los Angeles,grace@gmail.com,Bruce Wayne,4.0,both
7,108,Hannah Black,NaN,IT,NaN,2021-06-15,Bhopal,hannah@gmail.com,John Wick,2.0,both
8,109,Ian Grey,45.0,Admin,80000.0,2017-02-28,Bhopal,ian@company.com,NaN,NaN,left_only
9,110,Jane Doe,29.0,HR,51000.0,2020-04-10,New York,jane@outlook.com,Sarah Connor,1.0,both
10,111,Alice Smith,25.0,HR,50000.0,2020-01-15,New York,alice@gmail.com,Sarah Connor,1.0,both
11,112,Liam Scott,31.0,IT,62000.0,2019-08-08,Chicago,liam@yahoo.com,John Wick,2.0,both
12,113,Mona Lisa,27.0,Sales,54000.0,2021-12-01,Bhopal,mona@gmail.com,Tony Stark,3.0,both
13,114,NaN,33.0,Marketing,66000.0,2018-03-15,Los Angeles,NaN,Bruce Wayne,4.0,both
14,115,Oliver Twist,38.0,Admin,78000.0,2017-10-30,Chicago,oliver@company.com,NaN,NaN,left_only

67. **Outer Join:** Merge two dataframes keeping ALL rows from both.

In [198]:
pd.merge(df1,df2,how = 'outer')

,ID,Name,Age,Department,Salary,Join_Date,City,Email,Manager,Floor
0,109.0,Ian Grey,45.0,Admin,80000.0,2017-02-28,Bhopal,ian@company.com,NaN,NaN
1,115.0,Oliver Twist,38.0,Admin,78000.0,2017-10-30,Chicago,oliver@company.com,NaN,NaN
2,NaN,NaN,NaN,Finance,NaN,NaN,NaN,NaN,Gordon Gekko,5.0
3,101.0,Alice Smith,25.0,HR,50000.0,2020-01-15,New York,alice@gmail.com,Sarah Connor,1.0
4,105.0,Eva Green,22.0,HR,48000.0,2022-01-05,Chicago,eva@gmail.com,Sarah Connor,1.0
5,110.0,Jane Doe,29.0,HR,51000.0,2020-04-10,New York,jane@outlook.com,Sarah Connor,1.0
6,111.0,Alice Smith,25.0,HR,50000.0,2020-01-15,New York,alice@gmail.com,Sarah Connor,1.0
7,102.0,Bob Jones,30.0,IT,60000.0,2019-05-20,Los Angeles,bob@yahoo.com,John Wick,2.0
8,104.0,David Wilson,40.0,IT,70000.0,2018-07-25,Chicago,david@outlook.com,John Wick,2.0
9,108.0,Hannah Black,NaN,IT,NaN,2021-06-15,Bhopal,hannah@gmail.com,John Wick,2.0
10,112.0,Liam Scott,31.0,IT,62000.0,2019-08-08,Chicago,liam@yahoo.com,John Wick,2.0
11,107.0,Grace Lee,34.0,Marketing,65000.0,2019-11-01,Los Angeles,grace@gmail.com,Bruce Wayne,4.0
12,114.0,NaN,33.0,Marketing,66000.0,2018-03-15,Los Angeles,NaN,Bruce Wayne,4.0
13,103.0,Charlie Brown,35.0,Sales,55000.0,2021-03-10,New York,charlie@gmail.com,Tony Stark,3.0
14,106.0,Frank White,28.0,Sales,52000.0,2020-09-12,New York,frank@yahoo.com,Tony Stark,3.0
15,113.0,Mona Lisa,27.0,Sales,54000.0,2021-12-01,Bhopal,mona@gmail.com,Tony Stark,3.0

68. **Indicator:** Perform a merge and add a column `_merge` that tells you if the row came from "left_only", "right_only", or "both".

In [205]:
pd.merge(df1,df2,how = 'outer',indicator=True)

,ID,Name,Age,Department,Salary,Join_Date,City,Email,Manager,Floor,_merge
0,109.0,Ian Grey,45.0,Admin,80000.0,2017-02-28,Bhopal,ian@company.com,NaN,NaN,left_only
1,115.0,Oliver Twist,38.0,Admin,78000.0,2017-10-30,Chicago,oliver@company.com,NaN,NaN,left_only
2,NaN,NaN,NaN,Finance,NaN,NaN,NaN,NaN,Gordon Gekko,5.0,right_only
3,101.0,Alice Smith,25.0,HR,50000.0,2020-01-15,New York,alice@gmail.com,Sarah Connor,1.0,both
4,105.0,Eva Green,22.0,HR,48000.0,2022-01-05,Chicago,eva@gmail.com,Sarah Connor,1.0,both
5,110.0,Jane Doe,29.0,HR,51000.0,2020-04-10,New York,jane@outlook.com,Sarah Connor,1.0,both
6,111.0,Alice Smith,25.0,HR,50000.0,2020-01-15,New York,alice@gmail.com,Sarah Connor,1.0,both
7,102.0,Bob Jones,30.0,IT,60000.0,2019-05-20,Los Angeles,bob@yahoo.com,John Wick,2.0,both
8,104.0,David Wilson,40.0,IT,70000.0,2018-07-25,Chicago,david@outlook.com,John Wick,2.0,both
9,108.0,Hannah Black,NaN,IT,NaN,2021-06-15,Bhopal,hannah@gmail.com,John Wick,2.0,both
10,112.0,Liam Scott,31.0,IT,62000.0,2019-08-08,Chicago,liam@yahoo.com,John Wick,2.0,both
11,107.0,Grace Lee,34.0,Marketing,65000.0,2019-11-01,Los Angeles,grace@gmail.com,Bruce Wayne,4.0,both
12,114.0,NaN,33.0,Marketing,66000.0,2018-03-15,Los Angeles,NaN,Bruce Wayne,4.0,both
13,103.0,Charlie Brown,35.0,Sales,55000.0,2021-03-10,New York,charlie@gmail.com,Tony Stark,3.0,both
14,106.0,Frank White,28.0,Sales,52000.0,2020-09-12,New York,frank@yahoo.com,Tony Stark,3.0,both
15,113.0,Mona Lisa,27.0,Sales,54000.0,2021-12-01,Bhopal,mona@gmail.com,Tony Stark,3.0,both

69. **On vs Index:** Merge `df1` on column "key" and `df2` on its index.

72. **String - Upper:** Convert the "City" column to uppercase using `.str`.

In [213]:
df1['City'].str.upper()

0        NEW YORK
1     LOS ANGELES
2        NEW YORK
3         CHICAGO
4         CHICAGO
5        NEW YORK
6     LOS ANGELES
7          BHOPAL
8          BHOPAL
9        NEW YORK
10       NEW YORK
11        CHICAGO
12         BHOPAL
13    LOS ANGELES
14        CHICAGO
Name: City, dtype: object

73. **String - Contains:** Find all rows where "Email" contains "@gmail.com".

In [220]:
df1['Email'].str.contains('@gamil.com')

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13      NaN
14    False
Name: Email, dtype: object

74. **String - Split:** The "Name" column has "First Last". Split it into two columns.

75. **Map:** Convert "Gender" column `['M', 'F']` to `[0, 1]` using a dictionary and `.map()`.

76. **Pivot Table:** Create a spreadsheet-style pivot table with "Date" as rows, "City" as columns, and "Sales" as values.

77. **Date Conversion:** Convert a string column "Date_Str" to datetime objects using `pd.to_datetime`.

78. **Date Parts:** Extract the "Year" and "Month" from a datetime column.

79. **Resampling:** Downsample daily sales data to Monthly average sales (`.resample('M')`).

80. **Shift:** Create a new column "Previous_Price" that shifts the "Price" column down by 1 row (useful for calculating changes).

In [225]:
df1

,ID,Name,Age,Department,Salary,Join_Date,City,Email
0,101,Alice Smith,25.0,HR,50000.0,2020-01-15,New York,alice@gmail.com
1,102,Bob Jones,30.0,IT,60000.0,2019-05-20,Los Angeles,bob@yahoo.com
2,103,Charlie Brown,35.0,Sales,55000.0,2021-03-10,New York,charlie@gmail.com
3,104,David Wilson,40.0,IT,70000.0,2018-07-25,Chicago,david@outlook.com
4,105,Eva Green,22.0,HR,48000.0,2022-01-05,Chicago,eva@gmail.com
5,106,Frank White,28.0,Sales,52000.0,2020-09-12,New York,frank@yahoo.com
6,107,Grace Lee,34.0,Marketing,65000.0,2019-11-01,Los Angeles,grace@gmail.com
7,108,Hannah Black,NaN,IT,NaN,2021-06-15,Bhopal,hannah@gmail.com
8,109,Ian Grey,45.0,Admin,80000.0,2017-02-28,Bhopal,ian@company.com
9,110,Jane Doe,29.0,HR,51000.0,2020-04-10,New York,jane@outlook.com
10,111,Alice Smith,25.0,HR,50000.0,2020-01-15,New York,alice@gmail.com
11,112,Liam Scott,31.0,IT,62000.0,2019-08-08,Chicago,liam@yahoo.com
12,113,Mona Lisa,27.0,Sales,54000.0,2021-12-01,Bhopal,mona@gmail.com
13,114,NaN,33.0,Marketing,66000.0,2018-03-15,Los Angeles,NaN
14,115,Oliver Twist,38.0,Admin,78000.0,2017-10-30,Chicago,oliver@company.com

81. **Diff:** Calculate the difference between today's sales and yesterday's sales directly.

82. **Plotting:** Plot a simple line chart of "Sales" using `.plot()`.

In [229]:
df1.groupby('Department')['Salary'].mean()

Department
Admin        79000.000000
HR           49750.000000
IT           64000.000000
Marketing    65500.000000
Sales        53666.666667
Name: Salary, dtype: float64

85. **Explode:** You have a column where every cell contains a list `[A, B]`. How do you split these lists into separate rows?

86. **Memory Optimization:** How do you convert a string column with few unique values (e.g., "Low", "Med", "High") to a `Category` dtype to save memory?

87. **Query:** Use the `.query()` string syntax to filter rows where `Age > 25` and `Department == 'IT'`.

88. **Pipe:** Explain how to use `.pipe()` to chain custom functions for cleaner code.

89. **Window Functions:** Calculate a 7-day rolling average of the "Price" column.

90. **Crosstab:** Compute a simple frequency table of "Region" vs "Product" (How many of each product sold in each region).

91. How to drop duplicate rows? (`drop_duplicates`)

In [234]:
df1.drop_duplicates()

,ID,Name,Age,Department,Salary,Join_Date,City,Email
0,101,Alice Smith,25.0,HR,50000.0,2020-01-15,New York,alice@gmail.com
1,102,Bob Jones,30.0,IT,60000.0,2019-05-20,Los Angeles,bob@yahoo.com
2,103,Charlie Brown,35.0,Sales,55000.0,2021-03-10,New York,charlie@gmail.com
3,104,David Wilson,40.0,IT,70000.0,2018-07-25,Chicago,david@outlook.com
4,105,Eva Green,22.0,HR,48000.0,2022-01-05,Chicago,eva@gmail.com
5,106,Frank White,28.0,Sales,52000.0,2020-09-12,New York,frank@yahoo.com
6,107,Grace Lee,34.0,Marketing,65000.0,2019-11-01,Los Angeles,grace@gmail.com
7,108,Hannah Black,NaN,IT,NaN,2021-06-15,Bhopal,hannah@gmail.com
8,109,Ian Grey,45.0,Admin,80000.0,2017-02-28,Bhopal,ian@company.com
9,110,Jane Doe,29.0,HR,51000.0,2020-04-10,New York,jane@outlook.com
10,111,Alice Smith,25.0,HR,50000.0,2020-01-15,New York,alice@gmail.com
11,112,Liam Scott,31.0,IT,62000.0,2019-08-08,Chicago,liam@yahoo.com
12,113,Mona Lisa,27.0,Sales,54000.0,2021-12-01,Bhopal,mona@gmail.com
13,114,NaN,33.0,Marketing,66000.0,2018-03-15,Los Angeles,NaN
14,115,Oliver Twist,38.0,Admin,78000.0,2017-10-30,Chicago,oliver@company.com

92. How to rename columns? (`rename`)

In [236]:
df1.rename(columns={'Age':'age','Salary':'salary'},inplace=True)
df1

,ID,Name,age,Department,salary,Join_Date,City,Email
0,101,Alice Smith,25.0,HR,50000.0,2020-01-15,New York,alice@gmail.com
1,102,Bob Jones,30.0,IT,60000.0,2019-05-20,Los Angeles,bob@yahoo.com
2,103,Charlie Brown,35.0,Sales,55000.0,2021-03-10,New York,charlie@gmail.com
3,104,David Wilson,40.0,IT,70000.0,2018-07-25,Chicago,david@outlook.com
4,105,Eva Green,22.0,HR,48000.0,2022-01-05,Chicago,eva@gmail.com
5,106,Frank White,28.0,Sales,52000.0,2020-09-12,New York,frank@yahoo.com
6,107,Grace Lee,34.0,Marketing,65000.0,2019-11-01,Los Angeles,grace@gmail.com
7,108,Hannah Black,NaN,IT,NaN,2021-06-15,Bhopal,hannah@gmail.com
8,109,Ian Grey,45.0,Admin,80000.0,2017-02-28,Bhopal,ian@company.com
9,110,Jane Doe,29.0,HR,51000.0,2020-04-10,New York,jane@outlook.com
10,111,Alice Smith,25.0,HR,50000.0,2020-01-15,New York,alice@gmail.com
11,112,Liam Scott,31.0,IT,62000.0,2019-08-08,Chicago,liam@yahoo.com
12,113,Mona Lisa,27.0,Sales,54000.0,2021-12-01,Bhopal,mona@gmail.com
13,114,NaN,33.0,Marketing,66000.0,2018-03-15,Los Angeles,NaN
14,115,Oliver Twist,38.0,Admin,78000.0,2017-10-30,Chicago,oliver@company.com

93. How to check for nulls? (`isna` / `isnull`)

In [240]:
df1.dropna()

,ID,Name,age,Department,salary,Join_Date,City,Email
0,101,Alice Smith,25.0,HR,50000.0,2020-01-15,New York,alice@gmail.com
1,102,Bob Jones,30.0,IT,60000.0,2019-05-20,Los Angeles,bob@yahoo.com
2,103,Charlie Brown,35.0,Sales,55000.0,2021-03-10,New York,charlie@gmail.com
3,104,David Wilson,40.0,IT,70000.0,2018-07-25,Chicago,david@outlook.com
4,105,Eva Green,22.0,HR,48000.0,2022-01-05,Chicago,eva@gmail.com
5,106,Frank White,28.0,Sales,52000.0,2020-09-12,New York,frank@yahoo.com
6,107,Grace Lee,34.0,Marketing,65000.0,2019-11-01,Los Angeles,grace@gmail.com
8,109,Ian Grey,45.0,Admin,80000.0,2017-02-28,Bhopal,ian@company.com
9,110,Jane Doe,29.0,HR,51000.0,2020-04-10,New York,jane@outlook.com
10,111,Alice Smith,25.0,HR,50000.0,2020-01-15,New York,alice@gmail.com
11,112,Liam Scott,31.0,IT,62000.0,2019-08-08,Chicago,liam@yahoo.com
12,113,Mona Lisa,27.0,Sales,54000.0,2021-12-01,Bhopal,mona@gmail.com
14,115,Oliver Twist,38.0,Admin,78000.0,2017-10-30,Chicago,oliver@company.com

94. How to fill nulls with the value below? (`bfill`)

95. How to turn a DataFrame into a CSV string instead of a file? (`to_csv(None)`)

96. How to get the index of the maximum value? (`idxmax`)

97. How to calculate correlation between columns? (`corr`)

In [244]:
df1[['ID','age','salary']].corr()

              ID       age    salary
ID      1.000000  0.142313  0.337144
age     0.142313  1.000000  0.909053
salary  0.337144  0.909053  1.000000

98. How to get the n smallest values? (`nsmallest`)

99. How to iterate over rows (slow but sometimes needed)? (`iterrows`)

100. **The Golden Rule:** "If you are using a `for` loop in Pandas, you are probably doing it wrong." Why?


###  Viva / Interview Questions

10. **Values vs Array:** "Does `series.values` always return a NumPy array? What happens if the Series contains nullable integers or strings?"

11. **Lists vs Series:** "Why use a Pandas Series instead of a standard Python list? Name two specific advantages."

12. **Index Uniqueness:** "Does a Pandas Index *have* to be unique? What happens if I try to access a label that appears twice?"


21. **Unique vs Nunique:** "What is the difference between `.unique()` and `.nunique()`? Which one returns a list/array and which one returns a number?"

22. **Value_counts defaults:** "Does `.value_counts()` include `NaN` values by default? How can I force it to show missing value counts?"


31. **Series vs DataFrame:** "Technically, is a DataFrame a collection of Series? If I extract one row, what type of object do I get?"

32. **In-place:** "Most Pandas operations return a new object. Name one parameter common to many methods that allows you to modify the object in-place."


41. **Loc vs Iloc:** "Explain the fundamental difference between `.loc` and `.iloc`. Which one includes the 'stop' endpoint in a slice?"

42. **Copy vs View:** "If I select a subset like `df2 = df[df['Age'] > 20]`, does `df2` modify the original `df`? What is the `SettingWithCopyWarning`?"


52. **None vs NaN:** "In a pandas object of integers, what happens to the `dtype` if I introduce a `np.nan`? Why?"

53. **Hasnans:** "Series has a property `.hasnans`. Is this faster than checking `.isnull().any()`?"


61. **Split-Apply-Combine:** "Explain the 'Split-Apply-Combine' strategy. What is actually stored in the `groupby` object before you call an aggregation?"

62. **Transform:** "How is `.transform()` different from `.apply()`? If I want to normalize data within groups but keep the original shape, which one do I use?"


70. **Concat vs Merge:** "When should I use `concat` and when should I use `merge`?"

71. **Cardinality:** "What happens if I merge on a column that has duplicate values in BOTH dataframes? (Cartesian product/Explosion). Why is this dangerous?"


83. **Map vs Apply:** "`.map()` works on Series. `.apply()` works on DataFrames/Series. `.applymap()` works on DataFrames. Can you explain when to use which?"

84. **Vectorization (Strings):** "Why should I use `df['col'].str.lower()` instead of `df['col'].apply(lambda x: x.lower())`?"